; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	thermograph1 - mode
	image2 - mode
	infrared0 - mode
	GroundStation1 - direction
	Star3 - direction
	GroundStation5 - direction
	GroundStation7 - direction
	Star8 - direction
	Star10 - direction
	Star2 - direction
	Star9 - direction
	Star0 - direction
	Star6 - direction
	GroundStation4 - direction
	Star11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 image2)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star10)
	(calibration_target instrument0 Star6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 image2)
	(calibration_target instrument2 Star8)
	(calibration_target instrument2 GroundStation4)
	(supports instrument3 image2)
	(supports instrument3 infrared0)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star9)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 Star10)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star12)
	(supports instrument4 infrared0)
	(supports instrument4 thermograph1)
	(supports instrument4 image2)
	(calibration_target instrument4 GroundStation4)
	(supports instrument5 image2)
	(calibration_target instrument5 GroundStation4)
	(calibration_target instrument5 Star6)
	(calibration_target instrument5 Star0)
	(supports instrument6 image2)
	(calibration_target instrument6 GroundStation4)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation7)
)
(:goal (and
	(pointing satellite2 GroundStation1)
	(have_image Star11 thermograph1)
	(have_image Star12 thermograph1)
	(have_image Phenomenon13 thermograph1)
	(have_image Phenomenon14 image2)
	(have_image Planet15 infrared0)
	(have_image Star16 thermograph1)
))

)

; plan
1. (turn_to satellite1 star10 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star10)
   goals met: 0 of 7
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 7
3. (calibrate satellite1 instrument3 star10)
   added: (calibrated instrument3)
   goals met: 0 of 7
4. (turn_to satellite1 planet15 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 planet15)
   goals met: 0 of 7
5. (take_image satellite1 planet15 instrument3 infrared0)
   added: (have_image planet15 infrared0)
   goals met: 1 of 7
6. (turn_to satellite1 phenomenon14 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 phenomenon14)
   goals met: 1 of 7
7. (take_image satellite1 phenomenon14 instrument3 image2)
   added: (have_image phenomenon14 image2)
   goals met: 2 of 7
8. (turn_to satellite1 phenomenon13 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 phenomenon13)
   goals met: 2 of 7
9. (take_image satellite1 phenomenon13 instrument3 thermograph1)
   added: (have_image phenomenon13 thermograph1)
   goals met: 3 of 7
10. (turn_to satellite1 star11 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 star11)
   goals met: 3 of 7
11. (take_image satellite1 star11 instrument3 thermograph1)
   added: (have_image star11 thermograph1)
   goals met: 4 of 7
12. (turn_to satellite1 star12 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star12)
   goals met: 4 of 7
13. (take_image satellite1 star12 instrument3 thermograph1)
   added: (have_image star12 thermograph1)
   goals met: 5 of 7
14. (turn_to satellite1 star16 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star16)
   goals met: 5 of 7
15. (take_image satellite1 star16 instrument3 thermograph1)
   added: (have_image star16 thermograph1)
   goals met: 6 of 7
16. (turn_to satellite2 groundstation1 groundstation7)
   deleted: (pointing satellite2 groundstation7)
   added: (pointing satellite2 groundstation1)
   goals met: 7 of 7
